package com.charles.na.service.impl;

import com.charles.na.model.DocumentVector;
import com.charles.na.service.IVectorService;
import com.charles.na.utils.DocumentVector2MapUtil;
import org.junit.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.test.context.ContextConfiguration;
import org.springframework.test.context.junit4.SpringJUnit4ClassRunner;

import static org.junit.Assert.*;

/**
 * Created by huqj on 2018/4/17.
 */
@RunWith(SpringJUnit4ClassRunner.class)
@ContextConfiguration({"classpath:applicationContext.xml"})
public class VectorServiceImplTest {

    @Autowired
    private IVectorService vectorService;

    @Test
    public void testCalSimilarity() {
        DocumentVector v1 = new DocumentVector();
        v1.setVector("(判决:1 公司:1 建设:2 工商:1 栋:6 栏:1 提问:1 万元:16 红色:1 房事:1 法院:2 六号:1 民初:1 领导:15 主任:1 价格:6 商品房:21 对外:4 有两:1 总:8 销售:8 格:1 加盖:2 回答:1 局:38 几个:1 层:7 也从:1 摇:3 1000:1 案:2 并对:1 调查:4 员:1 状告:1 周边:4 走访:1 属:1 江:6 a:1 经营场所:1 恩:1 豪:1 提到:1 至少:3 外人:2 审查:1 号楼:2 米:1 answer:1 市房:3 高居:1 概况:1 原告:1 核准:1 一事:1 也有:1 综合:1 对照:2 楼的:1 员工:1 参考:2 两个:2 查询:1 姓名:1 房价:2 民事:1 为例:2 沙:1 桌面:1 登记:1 股:1 推荐:1 信息:3 进一步:1 合同书:1 说是:1 更多:1 但在:1 馆内:1 查封:1 车位:15 点:1 干部:1 都是:2 表格:1 面对:1 2012:2 分别为:2 专项:1 title:1 工程:3 2009:1 地下:3 网上:2 道人:1 人员:1 上涨:2 住所:1 住房:15 裙:3 开发:13 规划:27 名字:2 名录:2 名单:2 wu2198:1 半价:11 位于:1 按期归还:1 部:1 该局:5 多人:1 gt:2 2018:5 已被:1 2017:5 分房:1 一份:2 知情人:1 2016:4 2015:2 2014:4 2013:4 壹:2 当日:1 铺:1 系:2 2014337:3 小区:5 光头:1 处:7 超出:1 基准:1 环绕:1 判决书:8 低于:1 唐:2 4445:3 办理:5 起诉:1 还不:1 该项:1 号为:3 申请:2 是多少:2 立于:1 购:15 协助:1 局长:1 工商局:2 收:2 预售:20 分批:1 改:3 示:2 努力:1 芙蓉:2 元:7 一半:2 投资:4 颜色:1 一位:1 现任:1 商:13 公司版权:1 房管:1 23668:2 无意中:1 这一:1 套:2 浙:6 4000:1 question:1 m2:1 层数:4 号的:1 这是:1 很快:1 介绍:2 浪:1 既有:1 当晚:1 公:2 规划系统:1 南路:1 市场:3 有形:1 负责人:1 生人:1 相关:1 产权:3 海:1 人士:1 楼:12 许可证:10 人民币:1 长:28 4495:3 管理局:5 超:1 楼宇:2 项目:13 2195:1 知情:1 股市:1 疑:1 长安街:2 股东:1 违规:1 料:5 欠钱:1 公共建筑:1 农:1 商业:7 雁塔:3 之隔:1 方案:1 统一组织:1 注册:2 建筑面积:11 斯:1 冯:1 新:1 200:1 高楼:1 所说:1 权利人:1 是一:2 工商部门:1 公示栏:1 单位负责人:1 擅自:4 不到:1 位置:1 标注:2 包含:1 重:1 这批:2 金:2 委:2 销售价格:4 领导干部:1 离谱:1 通报:1 工会:1 关注:1 房屋:6 关系:7 日:11 17197:1 寻找:1 测量:1 凯:1 称:4 缴纳:1 发现:7 时:6 楼号:1 106:1 西安:21 添:1 财经:1 中的:2 低得:1 01:1 丁:1 市:1 04:1 爆:5 07:1 万:2 老旧:1 描述:1 明:1 成:1 关键:1 部门:1 中级:1 易:1 商报:15 作出:2 认购:1 二期:26 业:6 创:2 工作:1 公布:2 住宅:12 10:3 队:1 11:3 明白:1 6000:2 列入:2 16:2 17:1 老师:1 目录:8 注明:2 中:11 二维码:1 户:5 地面:2 比例:1 房:14 21:1 22:2 23:1 24:2 25:1 文件:2 记者:17 26:2 前任:1 27:1 29:2 陈:2 手:1 一层:1 楼层:1 环保局:3 378:1 这份:6 陕:1 保障:7 扛:1 30:3 询问:1 站上:1 幢:3 行政:1 37:1 书:2 人民法院:1 核实:1 亿元:1 疑问:1 年:25 保人:1 福利:1 这张:1 上午:1 12388:1 资本:1 批:1 空:1 人称:1 38637:1 阅读:1 爆发:1 这位:1 趋势:1 庆:28 参与:1 sinafinance:1 73585:2 151:1 房地产:1 单位:2 下午:1 隔:1 网友:1 商住楼:1 意见:1 购房:8 交:2 围挡:1 显示:6 花:1 怡人:1 限价:2 准许:1 人中:1 环境:1 唯一:1 粉丝:1 最新:1 63:2 内定:3 亿:1 现象:1 均由:1 细:3 扫描:1 采访:1 苏:2 盖:1 工作人员:4 处罚:4 曝:10 面积:4 自筹:1 拟:1 所购:1 团:20 平方米:32 不动产:1 拥:1 查到:1 就能:1 之友:1 园:2 目:1 分局:2 14409:1 曲:6 购买:3 审批:1 维:2 件:1 价:5 56805:2 资讯:1 83:2 份:1 黾:1 工会组织:1 开:1 大门口:1 滚动:1 拖欠:1 月:15 191:6 属实:1 一处:1 鼎:1 有关部门:1 住宅楼:2 端倪:1 通知:1 拍摄:1 拿到:4 97:2 伟:1 监察:1 许可:2 未:5 罚款:3 每平方米:2 大卫:1 企业:2 警觉:1 经营:2 区:1 有多:2 款:1 价低:1 分类:1 十:1 执法:1 权:2 事项:1 坊:28 知情者:1 位:13 华:21 住:1 空空:1 坐:1 网:2 下标:1 南:2 西安市:29 字:3 孙:1 世纪:1 占:1 多元:1 完整:2 荣:2 名胜古迹:1 来到:1 回事:1 业主:1 资格:1 置:6 距离:1 风景:1 影响:1 异常:2 已在:1 签:1 并未:1 咖啡:1 售价:4 新区:1 网点:1 近水楼台先得月:1 安:1 融:2 展示:1 被告人:2 徐:1 远远:1 风云:1 名下:11 播报:1 办公室:2 85973:1 林:1 商品住宅:1 视频:1 审:1 获悉:1 评价:1 39784:1 有限公司:6 此事:1 宪:1 环:1 华商:1 共有:2 容:1 红专:1 套房:5 人均:1 评:1 施工:1 连号:1 小时:1 第六:1 区县:1 发:4 多方:2 都用:1 租金:1 value:3 一路:1 签订:1 36010:2 证实:1 语:1 标有:2 不一致:1 区域:3 负责:1 叶:1 号:22 就不:1 5800:1 车库:2 资金来源:2 矿:1)");
        DocumentVector v2 = new DocumentVector();
        v2.setVector("(丁:1 光头:1 滚动:1 券商:4 爆:3 公司:3 股东大会:1 月:2 分配:1 税:2 明:1 鼎:1 吐:2 难言:1 我们将:1 biz:1 提问:1 易:1 回落:1 投资者:10 757:1 东:15 10:1 伟:1 nbsp:1 15:3 16:1 审议:1 老师:1 快讯:10 踩:1 含:2 二维码:1 大卫:1 大的:1 入市:1 谨慎:1 总:1 回答:1 派:2 倾诉:1 报道:1 24:1 元:3 投资:1 直线:10 风险:1 几次:1 公司版权:1 线索:2 前:1 098:1 空空:1 启动:1 公告:1 413:1 小型:1 657:1 共计:1 停:1 占:1 a:1 在这里:1 荣:2 无奈:1 竞争:1 question:1 征集:2 恩:1 浪:3 豪:1 市场:1 兴:15 截止:1 年:4 answer:1 福利:1 影响:1 海:1 人士:1 本次:1 须:1 炒过:1 回应:1 com:1 44:1 发稿:1 趋势:1 证券:14 诉求:1 观望:1 sinafinance:1 大跌:1 股市:1 徐:1 风云:1 播报:1 暴跌:10 网友:2 利润:1 料:3 沙:1 视频:1 农:1 55:1 股:4 方案:2 倾听:1 股本:1 更多:1 宪:1 议:10 讯:1 斯:1 冯:1 新:3 跳水:10 花:1 960:1 都将:1 年度:2 力差:1 容:1 粉丝:1 sina:1 最新:1 基数:1 每股:1 趴下:1 红利:2 扫描:1 跌:1 小时:1 title:1 重:1 正视:1 邮箱:1 金:3 694:1 仓:1 实施:2 道人:1 盘:1 高:1 还没:1 value:3 拟:1 关注:1 令:1 wu2198:1 日:2 早:1 之友:1 消息:2 权益:1 这家:1 热:10 凯:1 称:1 分派:1 2018:1 2017:2 发现:2 叶:1 雷:1 证券报:1 面上:1 资讯:1 添:1 财经:3 槽:2 finance:1 黾:1 矿:1)");
        long start = System.currentTimeMillis();
        //使用相似度更新向量
        double res = vectorService.calSimilarityBetweenMap(DocumentVector2MapUtil.convertDocumentVector2Map(v1)
                , DocumentVector2MapUtil.convertDocumentVector2Map(v2), true);
        System.out.println("相似度计算结果：" + res +
                ",耗时(ms)：" + (System.currentTimeMillis() - start));
        start = System.currentTimeMillis();
        //不使用相似度更新向量
        res = vectorService.calSimilarityBetweenMap(DocumentVector2MapUtil.convertDocumentVector2Map(v1)
                , DocumentVector2MapUtil.convertDocumentVector2Map(v2), false);
        System.out.println("相似度计算结果：" + res +
                ",耗时(ms)：" + (System.currentTimeMillis() - start));
    }

}